ГТС/УТГТС/DataProcessors/ИсправлениеОшибокВРегистреСведенийРаспределениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ИсправлениеОшибокВРегистреСведенийРаспределениеЗапасов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/РаспределениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РаспределениеЗапасов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезервироватьПоМереПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОбеспечениюБезРезерва</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтложитьРезервирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резервировать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбеспечивать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Зарезервировано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Свободно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Излишек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьНаСкладеПоВсемЗаказамСводно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РезервироватьПоМереПоступленияИтогНаДату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбеспеченоКОбеспечению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаспределениеЗапасовСостояния</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаОтгрузку</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузка</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖелаемаяДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПоступление</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемоеПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗаписиРаспределенияЗапасов</Name>
					<Comment>Дополнительный разделитель для ускорения записи наборов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/DataProcessors/ИсправлениеОшибокВРегистреСведенийРаспределениеЗапасов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОшибкиПроверкиКорректностиЗаписейРегистраСведенийРаспределениеЗапасовВФоне(Параметры, АдресРезультата) Экспорт
	
	ТаблицаОшибокВременная = Новый ТаблицаЗначений();
	ТаблицаОшибокВременная.Колонки.Добавить("Номенклатура");
	ТаблицаОшибокВременная.Колонки.Добавить("Характеристика");
	ТаблицаОшибокВременная.Колонки.Добавить("Склад");
	ТаблицаОшибокВременная.Колонки.Добавить("Назначение");
	Пакет = РаспределениеЗапасов.ОшибкиПроверкиКорректностиЗаписейРегистраСведенийРаспределениеЗапасов();
	Для Счетчик = 2 По Пакет.Количество() Цикл
		Таблица = Пакет[Счетчик - 1].Выгрузить();
		Для Каждого Строка Из Таблица Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаОшибокВременная.Добавить(), Строка);
		КонецЦикла;
	КонецЦикла;
	ТаблицаОшибокВременная.Свернуть("Номенклатура,Характеристика,Склад,Назначение");
	ПоместитьВоВременноеХранилище(ТаблицаОшибокВременная, АдресРезультата);
	
КонецПроцедуры

Процедура ИсправитьОшибкиРегистраСведенийРаспределениеЗапасовВФоне(Параметры, АдресРезультата) Экспорт
	
	Таблица = Параметры.Аналитики;
	
	СообщенияОбработки = Новый Массив();
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таблица.ЗаказНаОтгрузку КАК Ссылка
		|ИЗ
		|	РегистрСведений.РаспределениеЗапасов КАК Таблица
		|ГДЕ
		|	Таблица.Номенклатура = &Номенклатура
		|		И Таблица.Характеристика = &Характеристика
		|		И Таблица.Склад = &Склад
		|		И Таблица.Назначение = &Назначение
		|		И Таблица.ЗаказНаОтгрузку <> НЕОПРЕДЕЛЕНО";
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		ТранзакцияЗафиксирована = Истина;
		НачатьТранзакцию();
		Попытка
			
			БлокировкаДанных = Новый БлокировкаДанных();
			
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.РаспределениеЗапасов");
			ЭлементБлокировки.УстановитьЗначение("Номенклатура", СтрокаТаблицы.Номенклатура);
			ЭлементБлокировки.УстановитьЗначение("Характеристика", СтрокаТаблицы.Характеристика);
			ЭлементБлокировки.УстановитьЗначение("Склад", СтрокаТаблицы.Склад);
			БлокировкаДанных.Заблокировать();
			
			Запрос.УстановитьПараметр("Номенклатура", СтрокаТаблицы.Номенклатура);
			Запрос.УстановитьПараметр("Характеристика", СтрокаТаблицы.Характеристика);
			Запрос.УстановитьПараметр("Склад", СтрокаТаблицы.Склад);
			Запрос.УстановитьПараметр("Назначение", СтрокаТаблицы.Назначение);
			Заказы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			Набор = РаспределениеЗапасов.ОбновлениеИБПоТовару(СтрокаТаблицы);
			Набор.Записать();
			
			ЗаказыПосле = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			Для Каждого Ссылка Из ЗаказыПосле Цикл
				Заказы.Добавить(Ссылка);
			КонецЦикла;
			
			РаспределениеЗапасов.ИсключитьСсылкиТребующиеОтложенногоОбновления(Заказы);
			
			РегистрыКОтражению = СостоянияДокументов.РегистрыКОтражениюСостоянияЗаказов();
			РегистрыКОтражению.СостоянияЗаказовКлиентов    = Истина;
			РегистрыКОтражению.СостоянияВнутреннихЗаказов  = Истина;
			
			СостоянияДокументов.ДобавитьЗаданияКОтражениюСостоянияЗаказов(Неопределено, Заказы,, РегистрыКОтражению);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ТранзакцияЗафиксирована = Ложь;
			ТекстСообщения = НСтр("ru = 'Задание распределения запасов завершилось неудачно по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			СобытиеЖурнала = НСтр("ru = 'Распределение запасов'", ОбщегоНазначения.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(СобытиеЖурнала,
			                         УровеньЖурналаРегистрации.Ошибка,
			                         Метаданные.РегистрыСведений.РаспределениеЗапасов,
			                         ,
			                         ТекстСообщения);
			
		КонецПопытки;
		
		Если ТранзакцияЗафиксирована Тогда
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Обработан. Товар: %1, %2, Склад: %3, Назначение:%4'"),
				СтрокаТаблицы.Номенклатура,
				СтрокаТаблицы.Характеристика,
				СтрокаТаблицы.Склад,
				СтрокаТаблицы.Назначение);
			СообщенияОбработки.Добавить(ТекстСообщения);
			
		Иначе
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка обработки. Товар: %1, %2, Склад: %3, Назначение:%4'"),
				СтрокаТаблицы.Номенклатура,
				СтрокаТаблицы.Характеристика,
				СтрокаТаблицы.Склад,
				СтрокаТаблицы.Назначение);
			СообщенияОбработки.Добавить(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Структура("Сообщения", СообщенияОбработки);
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры



#КонецОбласти

#КонецЕсли
